import {ComponentProps} from '../types/ComponentProps';
import images from './images';

export interface AnswerProps {
  question: string;
  answer: ComponentProps[];
}

export const answerData: AnswerProps[] = [
  {
    question: 'Ребус №1',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: мультимедіа',
      },
    ],
  },
  {
    question: 'Що таке мультимедіа?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: ',
      },
      {
        type: 'text',
        text:
          "Мультимедіа - це сума технологій, що дозволяють комп'ютеру вводити, обробляти, зберігати, передавати і відображати такі типи даних, як текст, графіка, анімація, оцифровані нерухомі зображення, відео, звук, мова.",
      },
      {
        type: 'image',
        imageName: 'lizard',
        style: {
          width: 100,
          height: 100,
          alignSelf: 'center',
          transform: [{rotate: '45deg'}],
        },
      },
      {
        type: 'text',
        text:
          "Мультимедіа може бути класифікована як лінійна й нелінійна. Аналогом лінійного способу подання може бути кіно. Людина, що переглядає даний документ жодним чином не може вплинути на його зміст. Нелінійний спосіб подання інформації дозволяє людині брати участь у поданні інформації, взаємодіючи якимось чином із засобом відображення мультимедійних даних. Участь людини в даному процесі також називається «інтерактивністю». Такий спосіб взаємодії людини й комп'ютера найбільш повно представлений у категоріях відеоігор чи інтерактивних книжках. Іноді нелінійний спосіб подання і об'єднання даних називається «гіпермедіа».",
      },
    ],
  },
  {
    question: 'Три загальні принципи мультимедіа?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: ',
      },
      {
        type: 'text',
        text:
          'Представлення інформації за допомогою комбінації безлічі сприймаються людиною середовищ;',
      },
      {
        type: 'text',
        text: 'Наявність декількох сюжетних ліній у змісті продукту;',
      },
      {
        type: 'text',
        text: 'Художній дизайн інтерфейсу і засобів навігації.',
      },
    ],
  },
  {
    question: 'Сфери застосування мультимедіа?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: ',
      },
      {
        type: 'list',
        listItems: [
          'Мультимедіа в іграх',
          'Мультимедіа в освіті',
          'Мультимедіа в медицині',
          'Мультимедіа в бізнесі і менеджменті',
          'Мультимедіа в інформаційному забезпеченні',
          'Мультимедіа в мистецтві',
          'Віртуальна реальність',
        ],
        imageName: 'eye',
      },
    ],
  },
  {
    question:
      'Чим відрізняється лінійний спосіб представлення мільтимедіа від нелінійного?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: ',
      },
      {
        type: 'text',
        text:
          'Аналогом лінійного способу подання може бути кіно. Людина, що переглядає даний документ, ніяким чином не може вплинути на його зміст.',
      },
      {
        type: 'text',
        text:
          'Нелінійний спосіб представлення інформації дозво- ляє людині брати участь в поданні інформації, взає- модіючи якимось чином зі засобом відображення мультимедійних даних. Участь людини в даному про- цесі також називається «інтерактивністю».',
      },
      {
        type: 'image',
      },
    ],
  },
  {
    question: 'Ребус №2',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: флеш анімація.',
      },
    ],
  },
  {
    question: 'У чому відмінність растрової графіки від векторної?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'breakLine',
        style: {height: 10},
      },
      {
        type: 'text',
        text:
          'Растрова графіка складається з різнокольорових точок, а векторна з геометричних фігур. Примітно те, що векторну графіку можна легко перевести в растрову (растеризувати). Тобто векторний малюнок можна перевести в растрове зображення необхідно- го дозволу, але растрове зображення перевести в вектор досить складно без втрати якості.',
      },
    ],
  },
  {
    question: 'Ребус №3',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: Наскальні малюнки',
      },
    ],
  },
  {
    question: "Які п'ять типів різнорідних даних об'єднує мультимедіа?",
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'list',
        listItems: ['текст', 'графіка', 'звук', 'відео', 'анімація'],
        imageName: 'eye',
      },
    ],
  },
  {
    question: 'Хронологія розвитку?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'breakLine',
        style: {height: 30},
      },
      {
        type: 'text',
        text:
          '1984 - розробка і поширення графічного інтерфей- су користувача, створення додатків, що використову- ють нерухомі зображення і програвачі лазерних віде- одисків.',
      },
      {
        type: 'text',
        text:
          "1988 - з'являються CD-ROM, що дозволяють зберіга- ти великий обсяг інформації.",
      },
      {
        type: 'text',
        text:
          '1991 - розроблений стандарт QuickTime, що дозво- ляє записувати і відтворювати згодом цифрове відео.',
      },
      {
        type: 'text',
        text:
          "1994 - введено стандарт MPEG 1 і 2 форматів, що підвищують якість цифрового відео. З'явилися нові компакт-диски, що дозволяють записувати на поря- док більший обсяг інформації, ніж перше покоління.",
      },
      {
        type: 'image',
        imageName: 'lizard',
        style: {
          width: '60%',
          height: 100,
          transform: [{rotate: '45deg'}],
        },
      },
    ],
  },
  {
    question: 'Які бувають колірні моделі?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'list',
        listItems: ['RGB', 'CMY', 'CMYK', 'HSB', 'Lab', 'HSV', 'HSL'],
        imageName: 'eye',
      },
    ],
  },
  {
    question: 'Ребус №4',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: друкарська машинка.',
      },
    ],
  },
  {
    question: 'Що таке зоотроп, як він працює?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'breakLine',
        style: {height: 20},
      },
      {
        type: 'text',
        text:
          "У зоотроп диск з отворами замінений дерев'яним або металевим барабаном, відкритим зверху, прорі- заним вертикальними щілинами з боків і обертовими горизонтально на осі. Диск з картинками замінений довгою стрічкою, яка поміщається, згорнута в коло, всередині барабана. Ці стрічки могли вмістити п'ять, десять і більше дюжин картинок, тоді як диски не могли вмістити більше двох дюжин.",
      },
      {
        type: 'breakLine',
        style: {height: 20},
      },
      {
        type: 'image',
        imageName: 'answer13',
        style: {width: 200, height: 200, alignSelf: 'center'},
      },
    ],
  },
  {
    question: 'Ребус №5',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: відеокамера.',
      },
      {
        type: 'breakLine',
        style: {height: 20},
      },
      {
        type: 'text',
        text: 'Як ведеться боротьба з шумами і перешкодами?',
        style: {textAlign: 'center'},
      },
      {
        type: 'breakLine',
        style: {height: 20},
      },
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'text',
        text:
          'Активні методи боротьби з шумами і перешкодами складаються: У використанні проміжних підсилювачів сигналів, які компенсують їх загасання в лінії через провідникові і втрати на високих частотах через реактивності кабелю.',
      },
    ],
  },
  {
    question: 'Апаратні засоби мультимедіа технології?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'list',
        imageName: 'eye',
        listItems: [
          'засоби звукозапису',
          'засоби звуковідтворення',
          'маніпулятори',
          'засоби «віртуальної реальності»',
          'носії інформації',
          'засоби передачі',
          'засоби запису',
          'засоби обробки зображення',
        ],
      },
    ],
  },
  {
    question: 'Ребус №6',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: реклама.',
      },
    ],
  },
  {
    question: 'Дайте визначення гіпертексту.',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'breakLine',
        style: {height: 20},
      },
      {
        type: 'text',
        text:
          'Цифро-аналогове перетворення проводиться в два етапи. На першому етапі з потоку цифрових даних за допомогою цифроаналогового перетворювача виділяють відліки сигналу, що випливають із частотою дискретизації. На другому етапі з дискретних відліків формується шляхом згладжування (інтерполяції) без- перервний аналоговий сигнал.',
      },
    ],
  },
  {
    question: 'Ребус №7',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: відеопроектор.',
      },
    ],
  },
  {
    question:
      'Які в даний час є інструментальні засоби для використання гіпертексту?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'list',
        imageName: 'eye',
        listItems: [
          'редактори нерухомих графічних зображень',
          'засоби створення анімованих GIF-файлів',
          'засоби аудіо- та відеомонтажу',
          'засоби створення презентацій',
          'кошти розпізнавання текстів',
          'засоби створення навчальних програм',
          'системи створення віртуальної реальності',
          'системи розпізнавання голосу і перетворення звукових файлів в текстові',
        ],
      },
    ],
  },
  {
    question: 'Що відбувається на етапах цифро-аналогового перетворення?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'breakLine',
        style: {height: 20},
      },
      {
        type: 'text',
        text:
          'Цифро-аналогове перетворення проводиться в два етапи. На першому етапі з потоку цифрових даних за допомогою цифроаналогового перетворювача виділяють відліки сигналу, що випливають із частотою дискретизації. На другому етапі з дискретних відліків формується шляхом згладжування (інтерполяції) безперервний аналоговий сигнал.',
      },
    ],
  },
  {
    question: 'Ребус №8',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: зоотроп.',
      },
    ],
  },
  {
    question: 'Розкрийте переваги медіареклами?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'breakLine',
        style: {height: 20},
      },
      {
        type: 'text',
        text:
          'Медіареклама дозволяє оперативно стежити за реакцією і діями користувачів онлайн, прораховувати ефективність кампанії та при необхідності вносити швидкі зміни в рекламний блок.',
      },
      {
        type: 'text',
        text:
          'Будучи популярним інструментом інтернет-маркетингу, медійна реклама використовується для збільшен- ня впізнаваності бренду, іміджевого просування і залучення уваги покупців до нових товарів і послуг. З її допомогою ви легко можете збільшити відвіду- ваність інтернет-ресурсу або проінформувати цільову аудиторію про пропозиції, акції, знижки та майбутніх масштабних подіях.',
      },
    ],
  },
  {
    question: 'Що потрібно для підвищення якості відтворення звуку?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь:',
      },
      {
        type: 'breakLine',
        style: {height: 20},
      },
      {
        type: 'text',
        text:
          'В області цифрового звукозапису для підвищення якості відтворення звуку потрібно підвищення частоти дискретизації і числа розрядів без збільшення розмірів носія і скорочення часу запису.',
      },
    ],
  },
];
