import {ComponentProps} from '../types/ComponentProps';

export interface AnswerProps {
  question: string;
  answer: ComponentProps[];
}

export const answerData: AnswerProps[] = [
  {
    question: 'Ребус №1',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: мультимедіа',
      },
    ],
  },
  {
    question: 'Що таке мультимедіа?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: ',
      },
      {
        type: 'text',
        text:
          "Мультимедіа - це сума технологій, що дозволяють комп'ютеру вводити, обробляти, зберігати, передавати і відображати такі типи даних, як текст, графіка, анімація, оцифровані нерухомі зображення, відео, звук, мова.",
      },
      {
        type: 'text',
        text:
          "Мультимедіа може бути класифікована як лінійна й нелінійна. Аналогом лінійного способу подання може бути кіно. Людина, що переглядає даний документ жодним чином не може вплинути на його зміст. Нелінійний спосіб подання інформації дозволяє людині брати участь у поданні інформації, взаємодіючи якимось чином із засобом відображення мультимедійних даних. Участь людини в даному процесі також називається «інтерактивністю». Такий спосіб взаємодії людини й комп'ютера найбільш повно представлений у категоріях відеоігор чи інтерактивних книжках. Іноді нелінійний спосіб подання і об'єднання даних називається «гіпермедіа».",
      },
    ],
  },
  {
    question: 'Три загальні принципи мультимедіа?',
    answer: [
      {
        type: 'text',
        text: 'Відповідь: ',
      },
      {
        type: 'text',
        text:
          'Представлення інформації за допомогою комбінації безлічі сприймаються людиною середовищ;',
      },
      {
        type: 'text',
        text: 'Наявність декількох сюжетних ліній у змісті продукту;',
      },
      {
        type: 'text',
        text: 'Художній дизайн інтерфейсу і засобів навігації.',
      },
    ],
  },
];
