import {ComponentProps} from '../types/ComponentProps';
import {Dimensions} from 'react-native';

const {width, height} = Dimensions.get('screen');

export const articles: Article[] = [
  {
    title: 'Наскальні малюнки',
    breiflyContent:
      'Наскальні малюнки - зображення в печерах, виконані людьми епохи палеоліту, один з видів первісного мистецтва',
    article: [
      {
        type: 'image',
        imageName: 'maya',
        style: {
          width: '100%',
          height: height * 0.3,
        },
      },
      {
        type: 'text',
        text:
          "Наскальні малюнки - зображення в печерах, виконані людьми епохи палеоліту, один з видів первісного мистецтва. Печерний живопис - зображення в печерах, виконані людьми епохи палеоліту. Більшість подібних об'єктів знайдено в Європі, оскільки саме там стародавні люди були змушені жити в печерах і гротах, рятую- чись від холодів. Довгі роки сучасна цивілізація не мала уявлень про які-небудь об'єкти стародавнього живопису, проте в 1879 році археолог-любитель",
      },
      {
        type: 'breakLine',
      },
      {
        type: 'text',
        text:
          "Марселіно Санс де Сау-туола разом зі своєю 9-річною дочкою в ході прогу- лянки випадково натрапив на печеру Альтаміра, скле- піння якої були прикрашені безліччю малюнків давніх людей — знахідка, що не мала аналогів вкрай потряс- ла дослідника і сподвигла його на її пильне вивчення Роком пізніше Саутуола разом зі своїм другом Хуаном Вілановим-і-П'єром з Мадридського університету опублікували результати своїх досліджень, в яких датували виконання малюнків епохою палеоліту. Багато вчених сприйняли це повідомлення вкрай неоднозначно, Саутуолу звинувачували у фальсифікації знахідок, однак пізніше подібні печери були відкриті в багатьох інших куточках планети.",
      },
    ],
    imageName: 'maya',
  },
  {
    title: 'Книгодрукування',
    breiflyContent:
      'Йоганн Гутенберг - це німецький першодрукар. Він створив спосіб друкарства рухливими літерами',
    article: [
      {
        type: 'image',
        imageName: 'maya',
        style: {
          width: '100%',
          height: height * 0.3,
        },
      },
      {
        type: 'text',
        text:
          'Йоганн Гутенберг - німецький першодрукар. В середині 1440-х років створив спосіб друкарства рухливи- ми літерами, що зробив величезний вплив не тільки на європейську культуру, але і на всесвітню історію. Геніальний винахід Гутенберга полягало в тому, що він виготовляв з металу «рухливі» опуклі букви, вирізані в зворотному вигляді, набирав з них рядки і за допомо- гою спеціального преса відтискував на папері.',
      },
    ],
    imageName: 'maya',
  },
  {
    title: 'Фенакистископ',
    breiflyContent:
      'Фенакистископ - це лабораторний прилад для демонстрації рухомих різних малюнків',
    article: [
      {
        type: 'image',
        imageName: 'splashScreenTop',
        style: {
          width: '100%',
          height: height * 0.3,
        },
      },
      {
        type: 'text',
        text:
          'Фенакистископ - це лабораторний прилад який слугує для демонстрації рухомих різних малюнків У 1832 році Жозеф Плато створив прилад оптичного обману, який пізніше був названий фенакистископ. Сам Жозеф охарактеризував свій винахід так: «... принцип дії сучасного кіно, або, скоріше, закон, на якому заснована зйомка або проектування фільмів». Прилад складається з картонного диска з прорізани- ми в ньому отворами, на якому зображені різні фігури.',
      },
      {
        type: 'breakLine',
      },
      {
        type: 'text',
        text:
          'Під час обертання диска перед дзеркалом фігури, які проглядаються в дзеркалі через отвори диска, починають робити рухи в залежності від задум- ки ілюстрації. Хоча, здавалося б, що вони будуть обер- татися разом з диском. Цікавий факт: майже в цей же час професор геометрії Симон фон Штампфер створив апарат, дуже схожий на фенакистископ, і назвав його «стробоскопом». Ці двоє людей не знали робіт один одного і прийшли до своїх винаходів кожен своїм шляхом.',
      },
    ],
    imageName: 'splashScreenTop',
  },
  {
    title: 'Зоотроп',
    breiflyContent:
      'Зоотроп - цей даний пристрій для демонстрації рухомих малюнків, конструкція якого була заснована',
    article: [
      {
        type: 'image',
        imageName: 'maya',
        style: {
          width: '100%',
          height: height * 0.3,
        },
      },
      {
        type: 'text',
        text:
          "Зоотроп - пристрій для демонстрації рухомих малюнків, конструкція якого заснована на персистен- ції, тобто інерції людського зору. Винахідником зоот- роп вважається Вільям Джордж Горнер, але згадки про подібне приладі зустрічаються в китайських літо- писах від 180 року нашої ери. Зоотроп є трансформа- цією фенакистископ.У зоотроп диск з отворами замінений дерев'яним або металевим барабаном, відкритим зверху, прорізаним вертикальними щілинами з боків і обертовим гори- зонтально на осі.",
      },
    ],
    imageName: 'maya',
  },
  {
    title: 'Фонограф',
    breiflyContent:
      'Фонограф - це перший прилад для запису та відтворення звуку. Він винайдений Томасом Едісоном',
    article: [
      {
        type: 'image',
        imageName: 'maya',
        style: {
          width: '100%',
          height: height * 0.3,
        },
      },
      {
        type: 'text',
        text:
          'Фонограф - перший прилад для запису і відтворення звуку. Винайдено Томасом Едісоном, представлено 21 листопада 1877 року. Звук записується на носії в формі доріжки, глибина якої пропорційна гучності звуку. Звукова доріжка фонографа розміщується по циліндричної спіралі на змінному обертовому бара- бані. При відтворенні голка, що рухається по канавці, передає коливання на пружну мембрану, яка випромінює звук. Винахід став вражаючим подією того часу; подальшим розвитком фонографа стали грамофон і патефон.',
      },
    ],
    imageName: 'maya',
  },
];

export interface Article {
  title: string;
  breiflyContent: string;
  article: ComponentProps[];
  imageName: string;
}
