export const articles: Article[] = [
  {
    title: 'Зоотроп',
    breiflyContent:
      'Зоотроп - цей даний пристрій для демонстрації рухомих малюнків, конструкція якого була заснована',
    article:
      "Зоотроп - пристрій для демонстрації рухомих малюнків, конструкція якого заснована на персистен- ції, тобто інерції людського зору. Винахідником зоот- роп вважається Вільям Джордж Горнер, але згадки про подібне приладі зустрічаються в китайських літо- писах від 180 року нашої ери. Зоотроп є трансформа- цією фенакистископ.У зоотроп диск з отворами замінений дерев'яним або металевим барабаном, відкритим зверху, прорізаним вертикальними щілинами з боків і обертовим гори- зонтально на осі.",
    imageName: 'maya',
    imageBreiflyInformation: '',
  },
  {
    title: 'Книгодрукування',
    breiflyContent:
      'Йоганн Гутенберг - це німецький першодрукар. Він створив спосіб друкарства рухливими літерами',
    article:
      'Йоганн Гутенберг - німецький першодрукар. В сере- дині 1440-х років створив спосіб друкарства рухливи- ми літерами, що зробив величезний вплив не тільки на європейську культуру, але і на всесвітню історію. Геніальний винахід Гутенберга полягало в тому, що він виготовляв з металу «рухливі» опуклі букви, вирізані в зворотному вигляді, набирав з них рядки і за допомо- гою спеціального преса відтискував на папері.',
    imageName: 'maya',
    imageBreiflyInformation: '',
  },
];

export interface Article {
  title: string;
  breiflyContent: string;
  article: string;
  imageName: string;
  imageBreiflyInformation: string;
}
