export interface GlosaryText {
  title: string;
  article: string[];
}

export const glosaryArticles: GlosaryText[] = [
  {
    title: 'A',
    article: [
      'Анімація - технологія мультимедіа; відтворення послідовності картинок, що створює враження рухомого зображення. Ефект рухомого зображення виникає при частій зміні складу відеокадрів більше 16 кадрів в сек.',
      'Аудіовідеосистема - система, що забезпечує обробку текстової, графічної, звукової інформації, а також відеоданих.',
    ],
  },
  {
    title: 'B',
    article: [
      'Відеозахоплення - технологія мультимедіа; захоплення і збереження в цифровому вигляді окремих відеокадрів.',
      'Відеопроектори - проектори для роботи з джерелами аналогового відео сигналу в ТВ стандартах PAL, SECAM, NTSC (відеомагнітофони, телевізори, програвачі CD-I, DVD та ін.) Через інтефейс S-Video.',
      'Відеотехнологія - технологія розробки та демонстрації рухомих зображень.',
      "Віртуальна реальність - високорозвинена форма комп'ютерного моделювання, яка дозволяє користувачеві зануритися в штучний світ і безпосередньо діяти в ньому за допомогою спеціальних сенсорних пристроїв, які пов'язують його рухи з аудіовізуальними ефектами. При цьому зорові, слухові, дотикові і моторні відчуття користувача заміняються їх імітацією, що генерується комп'ютером.",
    ],
  },
  {
    title: 'Г',
    article: [
      'Гейт - дин з найбільш поширених приладів динамічної обробки. Основне, початкове призначення гейта - відсічення сигналів малого рівня, для яких він і є своєрідним клапаном, не пропускаючи їх на вихід.',
      "Гнучка телекамер - розглянутий клас портативних кольорових телекамер призначений для візуалізації документів і тривимірних об'єктів будь-яких розмірів.",
      'Графопроектор- птіческое пристрій, призначений для проектування інформації, нанесеної на спеціальну прозору плівку. Інформація на плівку наноситься за допомогою будь-якого копіювального апарату, лазерного або струменевого принтера або вручну спеціальними фломастерами. У порівнянні з іншими проекційними апаратами графопроектори відрізняються невисокою ціною, простотою виготовлення демонстраційних матеріалів і великою яскравістю зображення, оскільки принцип дії приладу заснований на просвічуванні прозорої плівки з інформацією - втрат світла при цьому не відбувається. ',
      'Галогенні лампи - лампа розжарювання, до складу газової суміші якій крім інертного газу входять галогени. При однакових зі звичайною лампою розжарювання потужністю і терміні служби має менші розміри, велику світлову віддачу і кращу стабільність світлового потоку. Однак по світловий температурі галогенні лампи сильно поступаються металогалогенні лампи.',
    ],
  },
  {
    title: 'З',
    article: [
      'Зворотна проекція - проекція зображення на просветний екран, при якій глядач і проекційне устаткування розташовані по різні боки від екрану.',
      "Звукові ефекти - технологія мультимедіа; збереження в цифровому вигляді звучання музичних інструментів, звуків природи або музичних фрагментів, створених на комп'ютері, або записаних і оцифровані.",
      'Зоотроп — пристрій, для створення ілюзії руху від швидкої послідовної зміни статичних зображень, конструкція якого заснована на персистенції, здатності сітківки ока зберігати зображення. Принцип роботи був відомий ще у давньому Китаї. Винахідником сучасного зоотропа є Вільям Джордж Горнер.',
    ],
  },
  {
    title: 'І',
    article: [
      "Інформаційна технологія - сукупність методів, виробничих і програмно-технологічних засобів, об'єднаних у технологічний ланцюжок, що забезпечує збір, зберігання, обробку, висновок і поширення інформації. Інформаційні технології призначені для зниження трудомісткості процесів використання інформаційних ресурсів.",
    ],
  },
  {
    title: 'K',
    article: [
      "Комп'ютерна графіка - технологія створення і обробки графічних зображень засобами обчислювальної техніки.",
      "Комп'ютерна графіка вивчає методи отримання зображень отриманих на підставі невізуальних даних або даних, створених безпосередньо користувачем.",
      "Комп'ютерна гра - гра, побудована з використанням мультимедійних можливостей комп'ютера.Комп'ютерна гра визначається алгоритмом, що описує процес її проходження. Комп'ютерні ігри поділяються на ділові, розвиваючі, навчальні та розважальні.",
      'Контрастність - коефіцієнт між білими і чорними елементами зображення. Більший коефіцієнт контрастності означає більшу здатність проектора до показу тонких кольорових деталей і меншу чутливість до освітленості приміщення.',
      'Корекція трапецеїдальних спотворень - виправлення геометричних спотворень зображення, що виникають через не паралельності оптичних осей проектора і екрана.',
      'Коефіцієнт посилення екрану - величина, що характеризує ступінь концентрації спрямованого до глядачів світлового потоку в порівнянні з відбитим від еталонної дифузійної поверхні.',
    ],
  },
  {
    title: 'Л',
    article: [
      "Літопис — історико-літературний твір у Русі, пізніше в Україні, Московщині та Білорусі, в якому оповідь велася за роками (хронологія). Писали переважно церковнослов'янською мовою, з численними вкрапленнями місцевої лексики. В інших християнських країнах подібні давні твори мають назву «хроніки», які писалися, як правило, латиною.",
    ],
  },
  {
    title: 'M',
    article: [
      'Мультимедійна продукція - поєднання звуку, тексту і образів в цифровій формі, придатне для відтворення на ЕОМ.',
      'Мультимедійні програми - енциклопедії, інтерактивні курси навчання, гри, Інтернет-додатки, тренажери, засоби торгової реклами, електронні презентації та ін.',
    ],
  },
  {
    title: 'O',
    article: [
      'Освітленість - відношення світлового потоку, який падає на площу поверхні, до величини цієї площі. Одиницею вимірювання освітленості є люкс.',
    ],
  },
  {
    title: 'П',
    article: [
      "Петрогліфи — висічені зображення на кам'яній основі, що є важливим історичним джерелом. Однозначного визначення петрогліфів не існує. Під визначення цього терміна підпадають як первісні печерні наскальні тесані малюнки, так і пізніші, наприклад, на спеціально встановлених камеях, мегалітах чи «диких» скелях.",
      "Печерний живопис — зображення в печерах, виконані людьми епохи палеоліту. Більшість подібних об'єктів знайдено в Європі, оскільки саме там стародавні люди були змушені жити в печерах і гротах, рятуючись від холодів.",
      'Піксель - основний елемент зображення. Загальна кількість пікселів визначає дозвіл екрана.',
    ],
  },
  {
    title: 'P',
    article: [
      'Різкість - величина, що характеризує якість відтворення меж ділянок зображень і контурів.',
    ],
  },
  {
    title: 'C',
    article: [
      'Світловий потік - потужність променевої енергії, що оцінюється по виробленому нею зорового відчуття або по її дії на селективний приймач світла. В СІ вимірюється в люменах.',
      'Слайд-проектори - одні з найбільш традиційних приладів, застосовуваних для проектування стандартних слайдів 24х36 мм, що заправляють у пластмасові рамки розміром 50х50 мм. Слайд-проектори прийнято ділити на 2 великі класи в залежності від використовуваних магазинів - круглих або прямокутних',
      "Ставлення контрастності - середнє значення білого зображення на чорному зображенні, що вимірюється в дев'яти центрах рівних прямокутників екрану. Пояснюється це тим, що будь-яке джерело світла при проектуванні чорного зображення проектує також деяку кількість білого зображення.",
      'Стоп-кадр - "заморожування" демонструється зображення для того, щоб непомітно для глядачів підібрати таке.',
    ],
  },
  {
    title: 'Т',
    article: [
      "Телевізійний прийом - технологія мультимедіа; висновок телевізійних сигналів на монітор комп'ютера паралельно з роботою інших програм.",
    ],
  },
  {
    title: 'Ф',
    article: [
      'Фонограф — пристрій для механічного запису і відтворення звуку, що широко використовувався наприкінці XIX — початку XX століття',
      'Функція інверсії. Дозволяє будь-позитивне зображення уявити в негативному вигляді або перевернути проектоване зображення зліва - направо.',
    ],
  },
  {
    title: 'Ц',
    article: [
      "Цифрова камера - принципово новий клас техніки, що дозволяє отримати статичні зображення об'єктів без використання фотоплівки і фотопаперу. Апарат здійснює електронне сканування оптичного образу і запам'ятовує його в своїй пам'яті. А потім цей образ можна відтворити на моніторі комп'ютера, ввести до електронного архіву, роздрукувати на принтері, спроектувати через відеопроектор на великий екран і т.д",
      "Цифровий інтерфейс музичних інструментів - стандарт, що дозволяє приєднувати до комп'ютера цифрові музичні інструменти, використовувані при творі і записи музики.",
    ],
  },
  {
    title: 'Я',
    article: [
      'Яскравість - атрибут візуального сприйняття, відповідно до якого область здається більш-менш освітленій. Яскравість вимірюється силою світла, випромінюваного одиницею поверхні. Одиницею яскравості є кандела / кв.м.',
    ],
  },
  {
    title: '5',
    article: [
      "5BNC - 5-контактний роз'єм байонетного типу для передачі аналогового RGB, HD, VD або компонентного Y, Pb , Pr відеосигналу. Забезпечує підключення комп'ютерних терміналів, графічних станцій або DVD-програвачів.",
    ],
  },
  {
    title: 'A',
    article: [
      'Aspect Ratio - формат зображення. Характеризує відношення ширини зображення до його висоти. У сучасній комерційній відеопродукції і HDTV (телебачення високої чіткості) використовується широкоформатне зображення 16: 9.',
      'ALIS - інноваційна технологія, розроблена корпорацією Hitachi. Заснована на принципі підсвічування поверхні плазми за допомогою парних і непарних електродів поперемінно, що дозволяє домогтися високої роздільної здатності (1024 × 1024) з мінімальним розміром пікселя, а також збільшити в 2 рази термін служби плазмових панелей без втрат в якості зображення.',
      "Audio  - 2-контактний роз'єм штирьового типу (RCA) з роздільним підключенням на лівий / правий канали для передачі аналогового аудіосигналу.",
      "Audio mini-Jack - міні-штирьовий роз'єм телефонного типу для передачі аналогового аудіосигналу.",
      "AVM - розроблений корпорацією Fujitsu цифровий процесор обробки вхідного відеосигналу, координально поліпшує якість зображення шляхом підвищення вертикального дозволу, усунення мерехтіння, шумових перешкод і спотворень при відображенні рухомих об'єктів.",
    ],
  },
  {
    title: 'B',
    article: [
      "BNC - байонетний мініатюрний роз'єм для коаксіального кабелю. Використовується для трансляції RGB аналогового відеосигналу, горизонтальної синхронізації, композитного відеосигналу.",
      'Built-in TV-Tuner - вбудована в корпус телевізора плата прийому телевізійного відеосигналу.',
    ],
  },
  {
    title: 'C',
    article: [
      'CCF -запатентована компанією NEC технологія, заснована на використанні кольорового фільтра, який суттєво зменшує частку оранжевого в червоному колірному спектрі, забезпечуючи тим самим відображення природного червоного кольору, завдяки чому досягається висока ступінь передачі кольору і чудову якість зображення.',
      "Component - 3-контактний роз'єм штирьового  або байонетного типу для передачі компонентного Y, Pb , Pr  відеосигналу. Забезпечує підключення DVD-програвача.",
      'Composite Video - композитний відеосигнал CVBS. Повна форма колірного відеосигналу, що складається з сигналів кольоровості і яскравості, кадрових малих і колірних синхроимпульсов, закодованих в один сигнал.',
      'Contrast Ratio - контрастність. Визначається як відношення максимальної освітленості контрольного екрану до мінімальної, при відображенні білого і чорного кольорів відповідно.',
    ],
  },
  {
    title: 'D',
    article: [
      'DCDi - сучасна технологія обробки відеосигналу від компанії Faroudja. Забезпечує згладжування зубчастих контурів, характерних для стандартного зображення з чергуванням рядків, в результаті чого на плазмовому екрані відтворюється більш чітке і плавне, близьке до природного зображення.',
      'D.I.S.T. - цифрова технологія масштабування зображення від корпорації JVC. Характеризується повною відсутністю ефектом мерехтіння і відтворенням спільно з системою управління кольором реалістичного зображення з високою роздільною здатністю.',
      'DNIe - новітня система оптимізації зображення від компанії Samsung. Позиціонується як технологія цифрової обробки відеосигналу для створення реалістичного зображення високої чіткості, що забезпечує максимально можливу якість, яскравість і контрастність на плазмових екранах будь-яких розмірів.',
      'DNR  - Система цифрового шумозаглушення для очищення вхідного відеосигналу від шумових і ефірних перешкод. Ідеально підходить для перегляду передач з неякісним прийомом антенного сигналу.',
      'Dolby Digital - Багатоканальний звуковий формат 5.1, який відтворює звук сучасного кінотеатру з ефектом присутності в центрі звукових подій, за допомогою двох фронтальних, одного центрального, двох тилових каналів навколишнього звуку і каналу сабвуфера.',
      'Dolby Pro Logic II -  новітня версія популярної системи домашнього кінотеатру Dolby Surround Pro Logic, що дозволяє відтворити звукове оточення в 5-канальної системі від стереофонічного джерела.',
      "D-Sub15 - 15-контактний прямий міні-роз'єм типу D-Sub для передачі аналогового RGB відеосигналу. Використовується для підключення персонального комп'ютера (ноутбука) або виведення зображення на додатковий зовнішній монітор.",
      "DTS - багатоканальний звуковий формат, заснований на новітніх технологіях 5.1-канального об'ємного звуку. На відміну від Dolby Digital, в DTS використовується менше стиснення звукового сигналу, що забезпечує більш високу якість звуку.",
    ],
  },
  {
    title: 'H',
    article: [
      'HDMI - мультимедійний інтерфейс високої чіткості. Забезпечує передачу нестислого відео і звуку від джерел цифрового відеосигналу високої чіткості. Застосовується для підключення DVD-програвача.',
      'HDTV - широкоекранне телебачення високої чіткості, що використовує передачу цифрового зображення і звуку.',
      'High XGA - високощільна розширена графічна матриця. Відповідає стандарту матриці з роздільною здатністю 1024х1024 пікселів. Характеризується витягнутої прямокутної формою пікселя.',
    ],
  },
  {
    title: 'M',
    article: [
      'MACH - технологія формування зображення від компанії Panasonic. Заснована на використанні формувача, оптимізованого для роботи з будь-яким відеовідтворювальна обладнанням, і нового чорного фільтра, що дозволяє досягати найвищого рівня контрастності при перегляді в умовах підвищеної освітленості. В результаті чого, на плазмовому екрані формується більш природне, насичене і дивно глибоке зображення з чіткими деталями, високою контрастністю і багатою градацією кольору.',
      "Memory Stick slot - роз'єм для зчитування цифрових карт пам'яті Memory Stick, використовуваних в фото-відео записуючої апаратури торгової марки Sony.",
      'MR - новітня технологія від компанії Sony, яка базується на використанні інтегральних схем обробки вхідного відеосигналу, що забезпечують чудову якість зображення.',
    ],
  },
  {
    title: 'P',
    article: [
      'PAP. Картинка і картинка - екран ділиться на дві рівні частини, в яких відтворюються стислі зображення двох різних телевізійних каналів (при наявності двох тюнерів) або телевізійного каналу і іншого видеоисточника.',
      'PAT. Картинка і Текст - екран ділиться на дві рівні частини, в одній з яких відтворюється стислий відеозображення, а в інший повна сторінка телетексту.',
      'Pixel - піксель - основна одиниця відеозображення. На плазмових екранах складається з трьох осередків, що відображають червоний, зелений і синій кольори. Загальна кількість пікселів визначає дозвіл екрана.',
      "Pixel Plus - інноваційна технологія від компанії Philips, що збільшує візуальне дозвіл екрана і забезпечує детальну промальовування рухомих об'єктів, природну чистоту і високу чіткість зображення.",
      'PIP Картинка в Картинці - функція, що дозволяє одночасно з переглядом однієї відеопрограми, вивести на екран другу відеопрограм в маленькому вікні в кутку екрану.',
      'PURE Drive - ексклюзивний цифровий процесор, створений Pioneer для обробки цифрових зображень з високою роздільною здатністю. Підсилює систему і зменшує шуми, забезпечуючи неймовірно яскраве і чітке зображення, а також найнижчий рівень енергоспоживання в галузі.',
    ],
  },
  {
    title: 'R',
    article: [
      "RCA - стандарт роз'єму штирового типу, використовуваного в коаксіальних кабелях для передачі аналогового аудіо чи відео.",
      'Remote Control - пульт дистанційного керування. Командне пристрій, призначений для управління обладнанням на відстані за допомогою передачі інфрачервоного сигналу.',
      'Resolution - роздільна здатність екрану. Характеризує щільність відображуваного зображення і визначається кількістю елементів зображення (пікселів) в одному рядку і загальною кількістю горизонтальних рядків. Чим вище роздільна здатність, тим більше інформації виводиться на екран.',
      'RGB - метод отримання кольорового зображення, заснований на передачі трьох складових кольору: червоного, зеленого і синього сигналів.',
      "RS-232C - 9-контактний прямий міні-роз'єм типу D-Sub для з'єднання каналу обміну даними. Забезпечує комп'ютерне управління джерелами відображення інформації і роботу з системами дистанційного керування.",
    ],
  },
  {
    title: 'S',
    article: [
      "SCART - стандарт універсального 21-контактного роз'єму штекерного типу для з'єднання AV-компонентів. Дозволяє передавати аналоговий RGB, роздільний Y / C і композитний відеосигнали.",
      'Subwoofer - високоякісний гучномовець, спеціально призначений для відтворення нижніх звукових частот.',
      "S-Video -  4-контактний міні-роз'єм типу DIN для роздільної передачі яркостной і цветностной складових відеосигналу . Використовується в відеостандарті S-VHS і Hi8 . Забезпечує підключення відеокамери або відеокарти персонального комп'ютера.",
    ],
  },
  {
    title: 'T',
    article: [
      'Teletext – Телетекст - безкоштовна послуга, яку надає телеканалами, що забезпечує цілодобовий доступ до інформаційних баз даних .',
      'TV-Tuner Box - приймач телевізійного відеосигналу (телевізійний тюнер), виконаний в корпусі додаткового зовнішнього пристрою.',
    ],
  },
  {
    title: 'V',
    article: [
      'VGA - графічна матриця. Відповідає стандарту матриці з роздільною здатністю 640х480 пікселів.',
      "Video - роз'єм штирьового або байонетного типу для передачі композитного відеосигналу. Забезпечує підключення аналогових джерел відеозображення.",
      'Virtual Dolby - звуковий формат, розроблений компанією Dolby Laboratories, що характеризується створенням ефекту навколишнього звуку  для двоканальних систем, завдяки процесорної обробки звукового сигналу.',
    ],
  },
  {
    title: 'W',
    article: [
      "WEGA Engine  - новітня технологія програмованого поліпшення якості зображення від компанії Sony. Включає систему цифрової обробки відеосигналу для отримання зображення з високим рівнем колірної градації і природною передачею кольору, цифровий гребінчастий фільтр для досягнення максимальної чистоти картинки, точності і плавності рухомих сцен, а також функцію створення зображення високої щільності зі збільшеним дозволом для забезпечення більш чіткого, гладкого і детального відображення об'єктів.",
      'Wide VGA - широкоформатний графічна матриця. Відповідає стандарту матриці з роздільною здатністю 852х480 пікселів.',
      'Wide XGA  - широкоформатний розширена графічна матриця. Відповідає стандарту матриці з роздільною здатністю 1280х768 або 1366х768 пікселів.',
    ],
  },
  {
    title: 'X',
    article: [
      'XGA - розширена графічна матриця. Відповідає стандарту матриці з роздільною здатністю 1024х768 пікселів.',
    ],
  },
  {
    title: 'Z',
    article: [
      'Zoom - зменшити масштаб відео для оптимального або повного використання формату екрану.',
    ],
  },
];
